nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/eth/processor/eth_p32mk0512gpe064.h
}

PLIB_INLINE_API ETH_PATTERN_MATCH_MODE _PLIB_UNSUPPORTED PLIB_ETH_PatternMatchModeGet(ETH_MODULE_ID index)
{
     return (ETH_PATTERN_MATCH_MODE)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_RxFiltersPMClr(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API bool PLIB_ETH_ExistsPatternMatch(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_RxFiltersPMSet(ETH_MODULE_ID index, ETH_PMATCH_MODE mode, uint64_t matchMask, uint32_t matchOffs, uint32_t matchChecksum)
{
     
}

PLIB_INLINE_API bool PLIB_ETH_ExistsRxFiltersPMSet(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_ReceiveFilterEnable(ETH_MODULE_ID index, ETH_RECEIVE_FILTER filter)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_ReceiveFilterDisable(ETH_MODULE_ID index, ETH_RECEIVE_FILTER filter)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_ReceiveFilterIsEnable(ETH_MODULE_ID index, ETH_RECEIVE_FILTER filter)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_RxFiltersSet(ETH_MODULE_ID index, ETH_RX_FILTERS rxFilters)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_RxFiltersClr(ETH_MODULE_ID index, ETH_RX_FILTERS rxFilters)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_RxFiltersWrite(ETH_MODULE_ID index, ETH_RX_FILTERS rxFilters)
{
     
}

PLIB_INLINE_API bool PLIB_ETH_ExistsReceiveFilters(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_RxFullWmarkSet(ETH_MODULE_ID index, uint8_t watermarkValue)
{
     
}

PLIB_INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_ETH_RxFullWmarkGet(ETH_MODULE_ID index)
{
     return (uint8_t)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_RxEmptyWmarkSet(ETH_MODULE_ID index, uint8_t watermarkValue)
{
     
}

PLIB_INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_ETH_RxEmptyWmarkGet(ETH_MODULE_ID index)
{
     return (uint8_t)0;
}

PLIB_INLINE_API bool PLIB_ETH_ExistsReceiveWmarks(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_InterruptSourceEnable(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_InterruptSourceDisable(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_InterruptSourceIsEnabled(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     return (bool)0;
}

PLIB_INLINE_API ETH_INTERRUPT_SOURCES _PLIB_UNSUPPORTED PLIB_ETH_InterruptSourcesGet(ETH_MODULE_ID index)
{
     return (ETH_INTERRUPT_SOURCES)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_InterruptSet(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_InterruptClear(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     
}

PLIB_INLINE_API ETH_INTERRUPT_SOURCES _PLIB_UNSUPPORTED PLIB_ETH_InterruptsGet(ETH_MODULE_ID index)
{
     return (ETH_INTERRUPT_SOURCES)0;
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_InterruptStatusGet(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_EventsEnableSet(ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_EventsEnableClr(ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents)
{
     
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_EventsEnableWrite(ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents)
{
     
}

PLIB_INLINE_API PLIB_ETH_EVENTS _PLIB_UNSUPPORTED PLIB_ETH_EventsEnableGet(ETH_MODULE_ID index)
{
     return (PLIB_ETH_EVENTS)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_EventsClr(ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents)
{
     
}

PLIB_INLINE_API PLIB_ETH_EVENTS _PLIB_UNSUPPORTED PLIB_ETH_EventsGet(ETH_MODULE_ID index)
{
     return (PLIB_ETH_EVENTS)0;
}

PLIB_INLINE_API bool PLIB_ETH_ExistsInterrupt(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_ETH_RxPacketCountGet(ETH_MODULE_ID index)
{
     return (uint8_t)0;
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_EthernetIsBusy(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_TransmitIsBusy(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ETH_ReceiveIsBusy(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API bool PLIB_ETH_ExistsEthernetControllerStatus(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_RxOverflowCountClear(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API uint16_t _PLIB_UNSUPPORTED PLIB_ETH_RxOverflowCountGet(ETH_MODULE_ID index)
{
     return (uint16_t)0;
}

PLIB_INLINE_API bool PLIB_ETH_ExistsReceiveOverflowCount(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_FramesTxdOkCountClear(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API uint16_t _PLIB_UNSUPPORTED PLIB_ETH_FramesTxdOkCountGet(ETH_MODULE_ID index)
{
     return (uint16_t)0;
}

PLIB_INLINE_API bool PLIB_ETH_ExistsFramesTransmittedOK(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_SingleCollisionCountClear(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API uint16_t _PLIB_UNSUPPORTED PLIB_ETH_SingleCollisionCountGet(ETH_MODULE_ID index)
{
     return (uint16_t)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_MultipleCollisionCountClear(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API uint16_t _PLIB_UNSUPPORTED PLIB_ETH_MultipleCollisionCountGet(ETH_MODULE_ID index)
{
     return (uint16_t)0;
}

PLIB_INLINE_API bool PLIB_ETH_ExistsCollisionCounts(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_FramesRxdOkCountClear(ETH_MODULE_ID index)
{
     
}

PLIB_INLINE_API uint16_t _PLIB_UNSUPPORTED PLIB_ETH_FramesRxdOkCountGet(ETH_MODULE_ID index)
{
     return (uint16_t)0;
}

PLIB_INLINE_API bool PLIB_ETH_ExistsFramexReceivedOK(ETH_MODULE_ID index)
{
     return (bool)0;
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ETH_FCSErrorCountClear(ETH_MODULE_ID index)
{
     
